In [2]:
import pandas as pd
import numpy as np
data = {
    "Name" : ["Akshay","Sam","Ram","Rutik","Sahil"],
    "Maths" : [45,34,49,42,27],
    "Science" : [34,50,43,34,43]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
 df.to_csv('data.csv')

In [5]:
df

     Name  Maths  Science
0  Akshay     45       34
1     Sam     34       50
2     Ram     49       43
3   Rutik     42       34
4   Sahil     27       43

In [6]:
df.describe()

           Maths   Science
count   5.000000   5.00000
mean   39.400000  40.80000
std     8.848729   6.83374
min    27.000000  34.00000
25%    34.000000  34.00000
50%    42.000000  43.00000
75%    45.000000  43.00000
max    49.000000  50.00000

In [7]:
df.groupby('Maths').describe()

      Science
        count  mean std   min   25%   50%   75%   max
Maths
27        1.0  43.0 NaN  43.0  43.0  43.0  43.0  43.0
34        1.0  50.0 NaN  50.0  50.0  50.0  50.0  50.0
42        1.0  34.0 NaN  34.0  34.0  34.0  34.0  34.0
45        1.0  34.0 NaN  34.0  34.0  34.0  34.0  34.0
49        1.0  43.0 NaN  43.0  43.0  43.0  43.0  43.0

In [10]:
df.groupby('Science').describe()

        Maths
        count  mean        std   min    25%   50%    75%   max
Science
34        2.0  43.5   2.121320  42.0  42.75  43.5  44.25  45.0
43        2.0  38.0  15.556349  27.0  32.50  38.0  43.50  49.0
50        1.0  34.0        NaN  34.0  34.00  34.0  34.00  34.0

In [12]:
df2 = pd.read_csv('Iris.csv')

In [13]:
df2

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [15]:
df2['SepalWidthCm'].min()

2.0

In [16]:
df2['SepalWidthCm'].max()

4.4

In [17]:
df2['SepalWidthCm'].mean()

3.0540000000000003

In [18]:
df2['SepalWidthCm'].median()

3.0

In [19]:
df2['SepalWidthCm'].mode()

0    3.0
Name: SepalWidthCm, dtype: float64